app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
INSERT INTO "comments" ("post_id", "commenter", "body", "updated_at", "created_at") VALUES (1, 'trey', 'hellow', '2011-03-12 22:48:13.308192', '2011-03-12 22:48:13.308192')

	def destroy
		@post = Post.find(params[:post_id])
		@comment = @post.comments.find(params[:id]).destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = 1
SELECT "comments".* FROM "comments" WHERE "comments"."id" = 1 AND ("comments".post_id = 1) LIMIT 1