app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "content", "updated_at", "name") VALUES ('2011-03-12 23:22:32.121284', 'this is a test for tags', 'hello tags, i will tag you tag', '2011-03-12 23:22:32.121284', 'Trey')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = 1 LIMIT 1
UPDATE "posts" SET "updated_at" = '2011-03-12 07:29:22.184649', "title" = 'Testing' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])